# Progetto finale
# Antonio Lombardo - Matricola 878179

You have to work on the University dataset. It contains three different university rankings:

    The Times Higher Education World University Ranking, shortly Times,
    the Academic Ranking of World Universities, shortly Shanghai,
    the Center for World University Rankings, shortly cwur.

##### Notes

    It is mandatory to use GitHub for developing the project.
    The project must be a jupyter notebook.
    There is no restriction on the libraries that can be used, nor on the Python version.
    All questions on the project must be asked in a public channel on Zulip.

Importo le librerie utilizzate.

In [1]:
import pandas as pd
import numpy as np
import re

Effettuo un preprocessing dei dati per verificare se nei database da utilizzare siano presenti righe contenenti valori nulli o valori anomali.

### Preprocessing database timesDb

In [2]:
timesDb = pd.read_csv('dataset_progetto/timesData.csv')
timesDb.head(3)

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011

Analizzo il tipo di ogni colonna del database timesDb.

In [3]:
timesDb.dtypes

world_rank                 object
university_name            object
country                    object
teaching                  float64
international              object
research                  float64
citations                 float64
income                     object
total_score                object
num_students               object
student_staff_ratio       float64
international_students     object
female_male_ratio          object
year                        int64
dtype: object

Effettuo un controllo solamente sulla colonna 'university_name' dato che un valore nullo non avrebbe senso. A differenza, per le altre colonne, Ã¨ possibile che il dato non sia stato rilevato e quindi accetto valori nulli se sono presenti.

In [4]:
timesDb['university_name'].isnull().any()

False

Non sono presenti missing value per i valori della colonna 'university_name'.

### Preprocessing database shanghaiDb

In [5]:
shanghaiDb = pd.read_csv('dataset_progetto/shanghaiData.csv')
shanghaiDb.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
0,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005
1,2,University of Cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005
2,3,Stanford University,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005
3,4,"University of California, Berkeley",3,72.8,71.8,76.0,69.4,73.9,72.2,52.7,2005
4,5,Massachusetts Institute of Technology (MIT),4,70.1,74.0,80.6,66.7,65.8,64.3,53.0,2005

Analizzo il tipo di ogni colonna del database shanghaiDb.

In [6]:
shanghaiDb.dtypes

world_rank          object
university_name     object
national_rank       object
total_score        float64
alumni             float64
award              float64
hici               float64
ns                 float64
pub                float64
pcp                float64
year                 int64
dtype: object

In [7]:
shanghaiDb['university_name'].isnull().any()

True

In [8]:
shanghaiDb[shanghaiDb['university_name'].isnull() == True]

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
3896,99,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2013

Decido di rimuovere la riga contente valori nulli per university_name

In [9]:
shanghaiDb.drop([3896], inplace = True)

In [10]:
shanghaiDb['university_name'].isnull().any()

False

Adesso non sono presenti missing value per i valori della colonna 'university_name'.

### Preprocessing database cdwurDb

In [11]:
cwurDb = pd.read_csv('dataset_progetto/cwurData.csv')
cwurDb.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

Analizzo il tipo di ogni colonna del database cwurDb.

In [12]:
cwurDb.dtypes

world_rank                int64
institution              object
country                  object
national_rank             int64
quality_of_education      int64
alumni_employment         int64
quality_of_faculty        int64
publications              int64
influence                 int64
citations                 int64
broad_impact            float64
patents                   int64
score                   float64
year                      int64
dtype: object

In [13]:
cwurDb['institution'].isnull().any()

False

Non sono presenti missing value per i valori della colonna institution.

# 1. For each university, extract from the times dataset the most recent and the least recent data, obtaining two separate dataframes.

Per restituire l'anno piÃ¹ recente, o meno recente, utilizzo il metodo idxmax(), o idxmin(), che ritorna l'indice esplicito.

In [14]:
timesDb_most_recent = timesDb.loc[timesDb.groupby('university_name')['year'].idxmax()]
timesDb_most_recent.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",17.0,1%,-,2016
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016

In [15]:
timesDb_least_recent = timesDb.loc[timesDb.groupby('university_name')['year'].idxmin()]
timesDb_least_recent.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",17.0,1%,-,2016
501,301-350,Aalborg University,Denmark,19.0,75.3,20.0,27.1,36.4,-,"17,422",15.9,15%,48 : 52,2012
502,301-350,Aalto University,Finland,26.2,49.0,22.2,37.5,61.9,-,"16,099",24.2,17%,32 : 68,2012
166,167,Aarhus University,Denmark,38.1,33.4,55.6,57.3,61.5,49.9,"23,895",13.6,14%,54 : 46,2011
476,276-300,Aberystwyth University,United Kingdom,19.8,63.8,15.5,56.6,35.5,-,"9,252",19.2,18%,48 : 52,2012

# 2. For each university, compute the improvement in income between the least recent and the most recent data points.

Per calcolare il miglioramento del reddito fra il dato piÃ¹ recente e meno recente, creo delle nuove tabelle partendo da quelle create al punto 1 e le unisco aggiungendo il suffisso _max e _min per la colonna 'income'.

In [16]:
timesDb_least_recent_income = timesDb_least_recent[['university_name', 'income']]
timesDb_most_recent_income = timesDb_most_recent[['university_name', 'income']]

In [17]:
times_db_union = pd.merge(timesDb_least_recent_income, timesDb_most_recent_income, on = ['university_name'], 
                          suffixes = ('_min', '_max'))
times_db_union.head()

                            university_name income_min income_max
0  AGH University of Science and Technology          -          -
1                        Aalborg University       36.4       43.7
2                          Aalto University       61.9       61.6
3                         Aarhus University       61.5       68.3
4                    Aberystwyth University       35.5       31.3

Analizzando i valori delle colonne 'income_max' e 'income_min' si nota la presenza di alcuni valori non rilevati indicati con '-'.

Si decide, quindi, di rimuovere tali valori.

Effettuo un controllo sulla colonna 'income_max'.

In [18]:
times_db_union[times_db_union['income_max'].str.contains('-')]['income_max'].count()

44

In [19]:
times_db_union_clear = times_db_union.drop(times_db_union[times_db_union['income_max'].str.contains('-')].index)

In [20]:
times_db_union_clear[times_db_union_clear['income_max'].str.contains('-')]['income_max'].count()

0

Effettuo un controllo sulla colonna 'income_min'.

In [21]:
times_db_union_clear[times_db_union_clear['income_min'].str.contains('-')]['income_min'].count()

70

In [22]:
times_db_union_clear.drop(times_db_union_clear[times_db_union['income_min'].str.contains('-')].index, inplace= True)

<ipython-input-22-3c027c266bb8>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  times_db_union_clear.drop(times_db_union_clear[times_db_union['income_min'].str.contains('-')].index, inplace= True)

In [23]:
times_db_union_clear[times_db_union_clear['income_min'].str.contains('-')]['income_min'].count()

0

In [24]:
times_db_union_clear.head()

              university_name income_min income_max
1          Aalborg University       36.4       43.7
2            Aalto University       61.9       61.6
3           Aarhus University       61.5       68.3
4      Aberystwyth University       35.5       31.3
5  Adam Mickiewicz University       28.7       28.7

Effettuo una conversione per le colonne 'income_min' e 'income_max' che da object diventano float per il calcolo della differenza del reddito.

In [25]:
times_db_union_clear['improvement'] = times_db_union_clear['income_max'].astype(float) \
                                        - times_db_union_clear['income_min'].astype(float)
times_db_union_clear

,university_name,income_min,income_max,improvement
1,Aalborg University,36.4,43.7,7.3
2,Aalto University,61.9,61.6,-0.3
3,Aarhus University,61.5,68.3,6.8
4,Aberystwyth University,35.5,31.3,-4.2
5,Adam Mickiewicz University,28.7,28.7,0.0
...,...,...,...,...
812,Zhejiang University,70.3,96.2,25.9
813,Ãcole Normale SupÃ©rieure,30.7,37.1,6.4
814,Ãcole Normale SupÃ©rieure de Lyon,26.1,31.7,5.6
816,Ãcole Polytechnique FÃ©dÃ©rale de Lausanne,38.0,65.4,27.4
817,Ãrebro University,29.8,29.8,0.0

# 3. Find the university with the largest increase computed in the previous point.

Tenendo in considerazione la richiesta del testo, non ci Ã¨ assicurato che solamente una sola universitÃ  abbia avuto il piÃ¹ alto improvement. Per tale motivo Ã¨ bene usare il metodo max(), invece di idxmax() che ritorna solamente la prima riga che soddisfa tale condizione, in modo da avere tutte le universitÃ  con pari improvement piÃ¹ alto.

In [26]:
times_db_union_clear.loc[times_db_union_clear['improvement'].idxmax()]

university_name    TU Dresden
income_min               31.9
income_max               99.7
improvement              67.8
Name: 428, dtype: object

In [27]:
times_db_union_clear[times_db_union_clear['improvement'] == times_db_union_clear['improvement'].max()]

    university_name income_min income_max  improvement
428      TU Dresden       31.9       99.7         67.8

# 4. For each ranking, consider only the most recent data point. For each university, compute the maximum difference between the rankings (e.g. for Aarhus University the value is 122-73=49). Notice that some rankings are expressed as a range.

Dall'analisi del database Ã¨ emerso che nella colonna 'world_rank' possono presentarsi 3 diverse situazioni:

    Â·valore numerico intero, esempio 54, 31, etc...
    Â·valore numeri intero preceduto da =, esempio =106, =106, etc...
    Â·intervallo numerico definito come 601-800, 201-250, etc...

Per avere la reale posizione del world_rank si Ã¨ deciso di utilizzare la funzione str.extract per estrarre il valore numerico e pulire la colonna 'world_rank'. Per quanto riguarda i valori ad intervallo si Ã¨ andato a considerare il valore centrale fra i due estremi ed inserito nella nuova colonna 'world_rank_position'. Per tale motivo si ha la conversitione da tipo object a tipo float.

Si utilizza la funzione numpy.where in cui viene messa come primo elemento la condizione, come secondo cosa fare se la condizione in questione Ã¨ soddisfatta e come terzo se non Ã¨ soddisfatta.

Tale pulizia viene effettuata su tutti e tre i database forniti.

### Pulizia timesDb

In [28]:
timesDb_most_recent['world_rank_min'] = timesDb_most_recent['world_rank'].str.extract('=*(\d+)-*').astype(float)
timesDb_most_recent['world_rank_max'] = timesDb_most_recent['world_rank'].str.extract('-(\d+)').astype(float)

In [29]:
timesDb_most_recent['world_rank_max'] = np.where((timesDb_most_recent['world_rank_max'] >= 0), 
                                                 timesDb_most_recent['world_rank_max'], 
                                                 timesDb_most_recent['world_rank_min'])
timesDb_most_recent.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,world_rank_min,world_rank_max
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",17.0,1%,-,2016,601.0,800.0
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016,201.0,250.0
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016,251.0,300.0
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016,106.0,106.0
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016,301.0,350.0

In [30]:
timesDb_most_recent['world_rank_position'] = (timesDb_most_recent['world_rank_max'] + timesDb_most_recent['world_rank_min']) / 2
timesDb_most_recent.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,world_rank_min,world_rank_max,world_rank_position
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",17.0,1%,-,2016,601.0,800.0,700.5
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016,201.0,250.0,225.5
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016,251.0,300.0,275.5
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016,106.0,106.0,106.0
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016,301.0,350.0,325.5

### Pulizia shanghaiDb

In [31]:
shanghaiDb_most_recent = shanghaiDb.loc[shanghaiDb.groupby('university_name')['year'].idxmax()]
shanghaiDb_most_recent.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
4697,301-400,Aalborg University,5,NaN,0.0,0.0,11.2,4.6,30.4,16.8,2015
4797,401-500,Aalto University,4-6,NaN,0.0,0.0,0.0,10.4,33.4,17.0,2015
4469,73,Aarhus University,2,27.3,11.5,22.1,12.3,25.8,51.8,31.0,2015
4497,101-150,Aix Marseille University,5-6,NaN,13.6,0.0,15.2,20.3,50.1,27.6,2015
3115,102-150,Aix-Marseille University,4-6,NaN,15.6,0.0,16.1,22.4,44.3,15.3,2011

In [32]:
shanghaiDb_most_recent['world_rank_min'] = shanghaiDb_most_recent['world_rank'].str.extract('=*(\d+)-*').astype(float)
shanghaiDb_most_recent['world_rank_max'] = shanghaiDb_most_recent['world_rank'].str.extract('-(\d+)').astype(float)

In [33]:
shanghaiDb_most_recent['world_rank_max'] = np.where((shanghaiDb_most_recent['world_rank_max'] >= 0), 
                                                    shanghaiDb_most_recent['world_rank_max'], 
                                                    shanghaiDb_most_recent['world_rank_min'])
shanghaiDb_most_recent.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,world_rank_min,world_rank_max
4697,301-400,Aalborg University,5,NaN,0.0,0.0,11.2,4.6,30.4,16.8,2015,301.0,400.0
4797,401-500,Aalto University,4-6,NaN,0.0,0.0,0.0,10.4,33.4,17.0,2015,401.0,500.0
4469,73,Aarhus University,2,27.3,11.5,22.1,12.3,25.8,51.8,31.0,2015,73.0,73.0
4497,101-150,Aix Marseille University,5-6,NaN,13.6,0.0,15.2,20.3,50.1,27.6,2015,101.0,150.0
3115,102-150,Aix-Marseille University,4-6,NaN,15.6,0.0,16.1,22.4,44.3,15.3,2011,102.0,150.0

In [34]:
shanghaiDb_most_recent['world_rank_position'] = (shanghaiDb_most_recent['world_rank_max'] + 
                                                 shanghaiDb_most_recent['world_rank_min']) / 2
shanghaiDb_most_recent.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,world_rank_min,world_rank_max,world_rank_position
4697,301-400,Aalborg University,5,NaN,0.0,0.0,11.2,4.6,30.4,16.8,2015,301.0,400.0,350.5
4797,401-500,Aalto University,4-6,NaN,0.0,0.0,0.0,10.4,33.4,17.0,2015,401.0,500.0,450.5
4469,73,Aarhus University,2,27.3,11.5,22.1,12.3,25.8,51.8,31.0,2015,73.0,73.0,73.0
4497,101-150,Aix Marseille University,5-6,NaN,13.6,0.0,15.2,20.3,50.1,27.6,2015,101.0,150.0,125.5
3115,102-150,Aix-Marseille University,4-6,NaN,15.6,0.0,16.1,22.4,44.3,15.3,2011,102.0,150.0,126.0

### Pulizia cwurDb

In [35]:
cwurDb_most_recent = cwurDb.loc[cwurDb.groupby('institution')['year'].idxmax()]
cwurDb_most_recent.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
1981,782,AGH University of Science and Technology,Poland,4,267,279,218,708,891,511,896.0,398,44.26,2015
1764,565,Aalborg University,Denmark,5,367,439,218,596,660,287,520.0,401,44.59,2015
1620,421,Aalto University,Finland,4,367,224,218,336,403,645,424.0,246,45.10,2015
1321,122,Aarhus University,Denmark,2,310,165,106,91,81,101,95.0,154,49.65,2015
2013,814,Aberystwyth University,United Kingdom,59,367,567,218,842,552,511,754.0,607,44.22,2015

### Normalizzazione del nome delle universitÃ

Analizzando i diversi database si Ã¨ notato che i nomi delle universitÃ  contenuti nella colonna 'university_name' possono assumere valori differenti nonostante puntino alla stessa universitÃ . Si Ã¨ deciso, allora, di normalizzare tali valori, grazie all'uso del database school_and_country__table, in modo che si avesse un nome comune per tutti i database relativo alle differenti universitÃ . 

La nuova colonna prenderÃ  il nome di 'university_name_normalized'.

In [36]:
school_and_country_table = pd.read_csv('dataset_progetto/school_and_country_table.csv')
school_and_country_table

                               school_name                   country
0                       Harvard University  United States of America
1       California Institute of Technology  United States of America
2    Massachusetts Institute of Technology  United States of America
3                      Stanford University  United States of America
4                     Princeton University  United States of America
..                                     ...                       ...
813                      Xidian University                     China
814                    Yeungnam University               South Korea
815            YÄ±ldÄ±z Technical University                    Turkey
816               Yokohama City University                     Japan
817           Yokohama National University                     Japan

[818 rows x 2 columns]

In [37]:
def normalize_function (column_value):
    
    for university in school_and_country_table['school_name']:
        if column_value == university:
            return column_value
        
    pattern = re.compile(column_value)
    for university in school_and_country_table['school_name']:
        occurrence = pattern.search(university)
        if occurrence:
            return university
        else:
            university_pattern = re.compile(university)
            match_university = university_pattern.search(column_value)
            if match_university:
                return university

Applico la funzione a tutti e tre i database.

In [38]:
shanghaiDb_most_recent['university_name_normalized'] = shanghaiDb_most_recent['university_name'].apply(normalize_function)

In [39]:
timesDb_most_recent['university_name_normalized'] = timesDb_most_recent['university_name'].apply(normalize_function)

In [40]:
cwurDb_most_recent['university_name_normalized'] = cwurDb_most_recent['institution'].apply(normalize_function)

Dalla normalizzazione della colonna 'university_name' sono emersi dei valori None poichÃ© la funzione normalize_function non ha trovato nessun match fra i nomi delle universitÃ  nel database shanghaiDb con i nomi contenuti nella colonna 'school_name' del database school_and_country_table. Si decide di rimuovere tali valori.

In [41]:
shanghaiDb_most_recent[['university_name', 'university_name_normalized']].tail()

           university_name university_name_normalized
3512  Yamaguchi University                       None
4695    Yeshiva University         Yeshiva University
4696     Yonsei University          Yonsei University
4396       York University            York University
4546   Zhejiang University        Zhejiang University

In [42]:
shanghaiDb_most_recent.drop(shanghaiDb_most_recent[shanghaiDb_most_recent['university_name_normalized'].isnull()].index, inplace = True)

In [43]:
timesDb_most_recent.drop(timesDb_most_recent[timesDb_most_recent['university_name_normalized'].isnull()].index, inplace = True)

In [44]:
cwurDb_most_recent.drop(cwurDb_most_recent[cwurDb_most_recent['university_name_normalized'].isnull()].index, inplace = True)

Dopo aver normalizzato il campo 'university_name' e rimosso i valori None vado a ricalcolare le universitÃ  con i dati piÃ¹ recenti.

In [45]:
shanghaiDb_most_recent_norm = shanghaiDb_most_recent.loc[shanghaiDb_most_recent.groupby('university_name_normalized')['year'].idxmax()]
shanghaiDb_most_recent_norm

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,world_rank_min,world_rank_max,world_rank_position,university_name_normalized
4697,301-400,Aalborg University,5,NaN,0.0,0.0,11.2,4.6,30.4,16.8,2015,301.0,400.0,350.5,Aalborg University
4797,401-500,Aalto University,4-6,NaN,0.0,0.0,0.0,10.4,33.4,17.0,2015,401.0,500.0,450.5,Aalto University
4469,73,Aarhus University,2,27.3,11.5,22.1,12.3,25.8,51.8,31.0,2015,73.0,73.0,73.0,Aarhus University
3115,102-150,Aix-Marseille University,4-6,NaN,15.6,0.0,16.1,22.4,44.3,15.3,2011,102.0,150.0,126.0,Aix-Marseille University
4798,401-500,Aristotle University of Thessaloniki,2,NaN,0.0,0.0,4.9,1.5,34.0,16.8,2015,401.0,500.0,450.5,Aristotle University of Thessaloniki
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4407,11,Yale University,9,54.5,47.6,50.4,51.0,58.8,63.0,37.8,2015,11.0,11.0,11.0,Yale University
4695,201-300,Yeshiva University,79-102,NaN,0.0,0.0,6.3,21.7,31.5,21.6,2015,201.0,300.0,250.5,Yeshiva University
4696,201-300,Yonsei University,2-5,NaN,0.0,0.0,8.6,4.9,52.1,21.4,2015,201.0,300.0,250.5,Yonsei University
4396,401-500,York University,19-21,NaN,0.0,0.0,0.0,10.1,30.6,12.4,2014,401.0,500.0,450.5,York University
4546,101-150,Zhejiang University,1-4,NaN,0.0,0.0,7.1,13.5,68.5,19.9,2015,101.0,150.0,125.5,Zhejiang University

In [46]:
timesDb_most_recent_norm = timesDb_most_recent.loc[timesDb_most_recent.groupby('university_name_normalized')['year'].idxmax()]
timesDb_most_recent_norm.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,world_rank_min,world_rank_max,world_rank_position,university_name_normalized
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",17.0,1%,-,2016,601.0,800.0,700.5,AGH University of Science and Technology
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016,201.0,250.0,225.5,Aalborg University
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016,251.0,300.0,275.5,Aalto University
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016,106.0,106.0,106.0,Aarhus University
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016,301.0,350.0,325.5,Aberystwyth University

In [47]:
cwurDb_most_recent_norm = cwurDb_most_recent.loc[cwurDb_most_recent.groupby('university_name_normalized')['year'].idxmax()]
cwurDb_most_recent_norm.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year,university_name_normalized
1981,782,AGH University of Science and Technology,Poland,4,267,279,218,708,891,511,896.0,398,44.26,2015,AGH University of Science and Technology
1764,565,Aalborg University,Denmark,5,367,439,218,596,660,287,520.0,401,44.59,2015,Aalborg University
1620,421,Aalto University,Finland,4,367,224,218,336,403,645,424.0,246,45.10,2015,Aalto University
1321,122,Aarhus University,Denmark,2,310,165,106,91,81,101,95.0,154,49.65,2015,Aarhus University
2013,814,Aberystwyth University,United Kingdom,59,367,567,218,842,552,511,754.0,607,44.22,2015,Aberystwyth University

Vado a calcolare 3 nuove tabelle in cui sono presenti solamente 'university_name_normalized' e 'world_rank_position'.

In [48]:
shanghaiDb_most_recent_rank = shanghaiDb_most_recent_norm[['university_name_normalized', 'world_rank_position']]
shanghaiDb_most_recent_rank

                university_name_normalized  world_rank_position
4697                    Aalborg University                350.5
4797                      Aalto University                450.5
4469                     Aarhus University                 73.0
3115              Aix-Marseille University                126.0
4798  Aristotle University of Thessaloniki                450.5
...                                    ...                  ...
4407                       Yale University                 11.0
4695                    Yeshiva University                250.5
4696                     Yonsei University                250.5
4396                       York University                450.5
4546                   Zhejiang University                125.5

[444 rows x 2 columns]

In [49]:
timesDb_most_recent_rank = timesDb_most_recent_norm[['university_name_normalized', 'world_rank_position']]
timesDb_most_recent_rank.head()

                    university_name_normalized  world_rank_position
2405  AGH University of Science and Technology                700.5
2003                        Aalborg University                225.5
2056                          Aalto University                275.5
1908                         Aarhus University                106.0
2105                    Aberystwyth University                325.5

In [50]:
cwurDb_most_recent_rank = cwurDb_most_recent_norm[['university_name_normalized', 'world_rank']]
cwurDb_most_recent_rank.head()

                    university_name_normalized  world_rank
1981  AGH University of Science and Technology         782
1764                        Aalborg University         565
1620                          Aalto University         421
1321                         Aarhus University         122
2013                    Aberystwyth University         814

Unisco i tre database in modo da porter calcolare la differenza fra la posizione di massimo e minimo rank assunta dalla univerisitÃ .

In [51]:
db_rank = pd.merge(timesDb_most_recent_rank, shanghaiDb_most_recent_rank, on = ['university_name_normalized'], 
                   suffixes = ('_times', '_shanghai'))
db_rank.head()

,university_name_normalized,world_rank_position_times,world_rank_position_shanghai
0,Aalborg University,225.5,350.5
1,Aalto University,275.5,450.5
2,Aarhus University,106.0,73.0
3,Aix-Marseille University,275.5,126.0
4,Aristotle University of Thessaloniki,700.5,450.5

In [52]:
db_rank1 = pd.merge(db_rank, cwurDb_most_recent_rank, on = ['university_name_normalized'], suffixes = ('_times', '_cwurd'))
db_rank1.head()

,university_name_normalized,world_rank_position_times,world_rank_position_shanghai,world_rank
0,Aalborg University,225.5,350.5,565
1,Aalto University,275.5,450.5,421
2,Aarhus University,106.0,73.0,122
3,Aix-Marseille University,275.5,126.0,206
4,Aristotle University of Thessaloniki,700.5,450.5,459

In [53]:
db_rank1.rename(columns = {'world_rank': 'world_rank_cwurd'}, inplace=True)
db_rank1

,university_name_normalized,world_rank_position_times,world_rank_position_shanghai,world_rank_cwurd
0,Aalborg University,225.5,350.5,565
1,Aalto University,275.5,450.5,421
2,Aarhus University,106.0,73.0,122
3,Aix-Marseille University,275.5,126.0,206
4,Aristotle University of Thessaloniki,700.5,450.5,459
...,...,...,...,...
427,Yale University,12.0,11.0,11
428,Yeshiva University,164.0,250.5,171
429,Yonsei University,325.5,250.5,98
430,York University,325.5,450.5,337
431,Zhejiang University,275.5,125.5,191

Controllo se si hanno valore nulli nei campi 'world_rank_position_' per le 3 colonne.

In [54]:
db_rank1['world_rank_position_times'].isnull().any()

False

In [55]:
db_rank1['world_rank_position_shanghai'].isnull().any()

False

In [56]:
db_rank1['world_rank_cwurd'].isnull().any()

False

Calcolo la differenza fra il valore massimo e il valore minimo utilizzando la funzione max(axis=1) in cui specifico che deve ricercare il valore fra le colonne (axis{index (0), columns (1)}).

In [57]:
db_rank1['rank_difference'] = db_rank1[['world_rank_position_times', 'world_rank_position_shanghai', 'world_rank_cwurd']].max(axis=1) \
                                - db_rank1[['world_rank_position_times', 'world_rank_position_shanghai', 'world_rank_cwurd']].min(axis=1)
db_rank1

,university_name_normalized,world_rank_position_times,world_rank_position_shanghai,world_rank_cwurd,rank_difference
0,Aalborg University,225.5,350.5,565,339.5
1,Aalto University,275.5,450.5,421,175.0
2,Aarhus University,106.0,73.0,122,49.0
3,Aix-Marseille University,275.5,126.0,206,149.5
4,Aristotle University of Thessaloniki,700.5,450.5,459,250.0
...,...,...,...,...,...
427,Yale University,12.0,11.0,11,1.0
428,Yeshiva University,164.0,250.5,171,86.5
429,Yonsei University,325.5,250.5,98,227.5
430,York University,325.5,450.5,337,125.0
431,Zhejiang University,275.5,125.5,191,150.0

# 5. Consider only the most recent data point of the times dataset. Compute the number of male and female students for each country.

In [58]:
timesDb_most_recent.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,world_rank_min,world_rank_max,world_rank_position,university_name_normalized
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",17.0,1%,-,2016,601.0,800.0,700.5,AGH University of Science and Technology
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016,201.0,250.0,225.5,Aalborg University
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016,251.0,300.0,275.5,Aalto University
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016,106.0,106.0,106.0,Aarhus University
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016,301.0,350.0,325.5,Aberystwyth University

Si nota come i valori assunti dalla colonna 'num_students' sono di tipo object poichÃ© Ã¨ presente la ',' per indicare le migliaia americana. Si usa, quindi, str.replace per rimuoverla e convertire la colonna nel tipo float.

In [59]:
timesDb_most_recent['num_students'] = timesDb_most_recent['num_students'].str.replace(',','').astype(float)

In [60]:
timesDb_most_recent['num_students']

2405    35569.0
2003    17422.0
2056    16099.0
1908    23895.0
2105     9252.0
         ...
1856     2400.0
2013     2218.0
1904     2429.0
1833     9666.0
2134     8788.0
Name: num_students, Length: 818, dtype: float64

Per calcolare il numero di ragazze e ragazzi esatto per ogni universitÃ  utilizzo la colonna 'female_male_ratio' in cui sono presenti in valore percentuale. Per alcune universitÃ  il valore Ã¨ mancante e viene indicato con '-'.

In [61]:
timesDb_most_recent['perc_female'] = timesDb_most_recent['female_male_ratio'].str.extract('(\d+) :').astype(float)
timesDb_most_recent['perc_male'] = timesDb_most_recent['female_male_ratio'].str.extract(' : (\d+)').astype(float)

In [62]:
timesDb_most_recent['num_female'] = (timesDb_most_recent['num_students'] * timesDb_most_recent['perc_female']) / 100
timesDb_most_recent['num_male'] = (timesDb_most_recent['num_students'] * timesDb_most_recent['perc_male']) / 100
timesDb_most_recent.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,...,female_male_ratio,year,world_rank_min,world_rank_max,world_rank_position,university_name_normalized,perc_female,perc_male,num_female,num_male
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,35569.0,...,-,2016,601.0,800.0,700.5,AGH University of Science and Technology,NaN,NaN,NaN,NaN
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,17422.0,...,48 : 52,2016,201.0,250.0,225.5,Aalborg University,48.0,52.0,8362.56,9059.44
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099.0,...,32 : 68,2016,251.0,300.0,275.5,Aalto University,32.0,68.0,5151.68,10947.32
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,...,54 : 46,2016,106.0,106.0,106.0,Aarhus University,54.0,46.0,12903.30,10991.70
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,9252.0,...,48 : 52,2016,301.0,350.0,325.5,Aberystwyth University,48.0,52.0,4440.96,4811.04

Dal calcolo esatto del numero di ragazzi e ragazze escono valori con la virgola. Si effettua, quindi, un'approssimazione per difetto o eccesso in base al valore.

In [63]:
timesDb_most_recent['num_female'] = timesDb_most_recent[timesDb_most_recent['num_female'].notnull()]['num_female'].round()
timesDb_most_recent['num_male'] = timesDb_most_recent[timesDb_most_recent['num_male'].notnull()]['num_male'].round()

In [64]:
timesDb_most_recent.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,...,female_male_ratio,year,world_rank_min,world_rank_max,world_rank_position,university_name_normalized,perc_female,perc_male,num_female,num_male
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,35569.0,...,-,2016,601.0,800.0,700.5,AGH University of Science and Technology,NaN,NaN,NaN,NaN
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,17422.0,...,48 : 52,2016,201.0,250.0,225.5,Aalborg University,48.0,52.0,8363.0,9059.0
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,16099.0,...,32 : 68,2016,251.0,300.0,275.5,Aalto University,32.0,68.0,5152.0,10947.0
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,...,54 : 46,2016,106.0,106.0,106.0,Aarhus University,54.0,46.0,12903.0,10992.0
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,9252.0,...,48 : 52,2016,301.0,350.0,325.5,Aberystwyth University,48.0,52.0,4441.0,4811.0

In [65]:
country_num_female = timesDb_most_recent.groupby('country', as_index = False)['num_female'].sum()
country_num_male = timesDb_most_recent.groupby('country', as_index = False)['num_male'].sum()

In [66]:
country_students = pd.merge(country_num_female, country_num_male, on = 'country')
country_students

                      country  num_female   num_male
0                   Argentina     67191.0    41182.0
1                   Australia    391736.0   321640.0
2                     Austria     68364.0    66113.0
3                  Bangladesh     21323.0    41393.0
4                     Belarus     20219.0     9084.0
..                        ...         ...        ...
67  Unisted States of America         0.0        0.0
68       United Arab Emirates      9516.0     4931.0
69             United Kingdom    711814.0   613028.0
70   United States of America   1601453.0  1556324.0
71              Unted Kingdom         0.0        0.0

[72 rows x 3 columns]

Dall'analisi dei valori si puÃ² notare come ci siano degli errori di scrittura nel nome del paese.

In particolare: 
    
    Unted Kingdom con United Kingdom
    Unisted States of America con United States of America
    
Il valore del count effettuato su questi paesi risulta essere pari a 0. Si va ad indagare la presenza di errori nel nome di altri paesi andando a stampare tutti i paesi con valore pari a 0.

In [67]:
country_students[country_students['num_female'] == country_students['num_female'].min()]

                      country  num_female  num_male
67  Unisted States of America         0.0       0.0
71              Unted Kingdom         0.0       0.0

In [68]:
country_students[country_students['num_male'] == country_students['num_male'].min()]

                      country  num_female  num_male
67  Unisted States of America         0.0       0.0
71              Unted Kingdom         0.0       0.0

Si decide, quindi, di rimuovere le righe 67 e 71 dal database.

In [69]:
country_students.drop([67,71], inplace=True)

In [70]:
country_students

                     country  num_female   num_male
0                  Argentina     67191.0    41182.0
1                  Australia    391736.0   321640.0
2                    Austria     68364.0    66113.0
3                 Bangladesh     21323.0    41393.0
4                    Belarus     20219.0     9084.0
..                       ...         ...        ...
65                    Uganda     18670.0    18670.0
66                   Ukraine     17846.0    19250.0
68      United Arab Emirates      9516.0     4931.0
69            United Kingdom    711814.0   613028.0
70  United States of America   1601453.0  1556324.0

[70 rows x 3 columns]

# 6. Find the universities where the ratio between female and male is below the average ratio (computed over all universities).

In [71]:
timesDb_most_recent['ratio'] = timesDb_most_recent['perc_female'] / timesDb_most_recent['perc_male']
timesDb_most_recent['ratio']

2405         NaN
2003    0.923077
2056    0.470588
1908    1.173913
2105    0.923077
          ...
1856    0.851852
2013    0.960784
1904    0.219512
1833    0.369863
2134    1.564103
Name: ratio, Length: 818, dtype: float64

Dopo aver calcolato il rapporto fra la percentuale di femmine sulla percentuale di uomini vado a verificare se sono presenti valori infiniti dovuti dalla presenza di un'universitÃ  interamente composta da parte femminile (100/0).

In [72]:
timesDb_most_recent.loc[timesDb_most_recent['ratio'] == np.inf]

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,...,year,world_rank_min,world_rank_max,world_rank_position,university_name_normalized,perc_female,perc_male,num_female,num_male,ratio
2227,401-500,Ewha Womans University,South Korea,23.9,34.3,18.3,50.4,57.6,-,17625.0,...,2016,401.0,500.0,450.5,Ewha Womans University,100.0,0.0,17625.0,0.0,inf

Sostituisco il valore infinito con 100 che rappresenta la totalitÃ .

In [73]:
timesDb_most_recent['ratio'].replace({np.inf: 100}, inplace= True)

Calcolo il valor medio di tutti i rapporti ottenuti ai punti precedenti.

In [74]:
avg_ratio = timesDb_most_recent['ratio'].mean()
avg_ratio

1.2149571636836496

In [75]:
timesDb_most_recent.loc[timesDb_most_recent['ratio'] < avg_ratio][['university_name', 'ratio']]

                               university_name     ratio
2003                        Aalborg University  0.923077
2056                          Aalto University  0.470588
1908                         Aarhus University  1.173913
2105                    Aberystwyth University  0.923077
2406                           Ajou University  0.492537
...                                        ...       ...
2104                       Zhejiang University  0.694915
1856                  Ãcole Normale SupÃ©rieure  0.851852
2013          Ãcole Normale SupÃ©rieure de Lyon  0.960784
1904                       Ãcole Polytechnique  0.219512
1833  Ãcole Polytechnique FÃ©dÃ©rale de Lausanne  0.369863

[468 rows x 2 columns]

# 7. For each country, compute the fraction of the students in the country that are in one of the universities computed in the previous point (that is, the denominator of the ratio is the total number of students over all universities in the country).

Salvo il risultato precedente in 'timesDb_most_recent_below_avg' in modo da porter eseguire un groupby per country e ottenere la somma di tutti gli studenti delle universitÃ .

In [76]:
timesDb_most_recent_below_avg = timesDb_most_recent.loc[timesDb_most_recent['ratio'] < avg_ratio]

In [77]:
timesDb_most_recent_below_avg_for_country = timesDb_most_recent_below_avg.groupby('country', as_index = False)['num_students'].sum()
timesDb_most_recent_below_avg_for_country.head()

      country  num_students
0   Australia      295021.0
1     Austria       79242.0
2  Bangladesh       62716.0
3     Belgium      116129.0
4      Brazil      438476.0

Dal dataframe timesDb_most_recent vado a raggrupare per country e ottengo il numero totale di studenti per ogni paese (questo sarÃ  il denominatore nel calcolo del point).

In [78]:
timesDb_most_recent_for_country = timesDb_most_recent.groupby('country', as_index = False)['num_students'].sum()
timesDb_most_recent_for_country.head()

      country  num_students
0   Argentina      108373.0
1   Australia      743627.0
2     Austria      134477.0
3  Bangladesh       62716.0
4     Belarus       29303.0

In [79]:
results = pd.merge(timesDb_most_recent_below_avg_for_country, timesDb_most_recent_for_country, on = 'country', 
                   suffixes = ('', '_tot') )
results['results'] = results['num_students'] / results['num_students_tot']
results.head()

      country  num_students  num_students_tot   results
0   Australia      295021.0          743627.0  0.396733
1     Austria       79242.0          134477.0  0.589261
2  Bangladesh       62716.0           62716.0  1.000000
3     Belgium      116129.0          169661.0  0.684477
4      Brazil      438476.0          534688.0  0.820060

# 8. Read the file educational_attainment_supplementary_data.csv, discarding any row with missing country_name or series_name.

In [80]:
educ_att_sup = pd.read_csv('dataset_progetto/educational_attainment_supplementary_data.csv')
educ_att_sup.head(3)

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN

In [81]:
educ_att_sup[(educ_att_sup['country_name'].isnull()) | (educ_att_sup['series_name'].isnull())]

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
79050,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
79051,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
79052,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
79053,Data from database: Education Statistics: Educ...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
79054,Last Updated: 10/20/2015,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Utilizzo la funzione dropna per rimuovere le righe che hanno come valori mancanti una dei valori delle colonne 'country_name' o 'series_name'.

Successivamente effettuo un ulteriore controllo.

In [82]:
educ_att_sup.dropna(subset = ['country_name', 'series_name'], inplace = True)

In [83]:
educ_att_sup[(educ_att_sup['country_name'].isnull()) | (educ_att_sup['series_name'].isnull())]

Empty DataFrame
Columns: [country_name, series_name, 1985, 1986, 1987, 1990, 1991, 1992, 1993, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2015]
Index: []

[0 rows x 29 columns]

# 9. From attainment build a dataframe with the same data, but with 4 columns: country_name, series_name, year, value.

In [84]:
educ_att_sup.head(3)

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN

Utilizzo la funzione melt() per modificare la struttura del database. Assegno una nuova colonna chiamata 'year' a cui inserisco tutte le date che nella tabella 'educ_att_sup' erano delle colonne.

In [85]:
melt_educ_att_sup = pd.melt(educ_att_sup, id_vars = ['country_name', 'series_name'], 
                            value_vars = ['1985', '1986', '1987', '1990', '1991', '1992', '1993', '1995', '1996', '1997', '1998', 
                                          '1999', '2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007', '2008', '2009',
                                          '2010', '2011', '2012', '2013', '2015'], var_name = 'year')
melt_educ_att_sup.head()

  country_name                                        series_name  year  value
0  Afghanistan  Barro-Lee: Average years of primary schooling,...  1985   0.33
1  Afghanistan  Barro-Lee: Average years of primary schooling,...  1985   1.03
2  Afghanistan  Barro-Lee: Average years of primary schooling,...  1985   0.83
3  Afghanistan  Barro-Lee: Average years of primary schooling,...  1985   2.34
4  Afghanistan  Barro-Lee: Average years of primary schooling,...  1985   0.54

# 10. For each university, find the number of rankings in which they appear (it suffices to appear in one year for each ranking).

Applico la funzione 'normalize_function' a 'university_name', che contiene il nome delle universitÃ , ai 3 database di partenza e vado a salvare tale valore in una nuova colonna, 'university_name_normalized'. Questo passaggio mi permette di andare a valutare il ranking dell'universitÃ  per ogni anno tenendo conto di piÃ¹ classificazioni in anni differenti.

In [86]:
shanghaiDb['university_name_normalized'] = shanghaiDb['university_name'].apply(normalize_function)

In [87]:
timesDb['university_name_normalized'] = timesDb['university_name'].apply(normalize_function)

In [88]:
cwurDb['university_name_normalized'] = cwurDb['institution'].apply(normalize_function)

Come nel punto 4. dalla normalizzazione della colonna contente i nomi delle universitÃ  sono emersi dei valori None poichÃ© la funzione normalize_function non ha trovato nessun match fra i nomi delle universitÃ  nel database shanghaiDb con i nomi contenuti nella colonna 'school_name' del database school_and_country_table. Si decide di rimuovere tali valori.

In [89]:
shanghaiDb[['university_name', 'university_name_normalized']].tail()

                      university_name       university_name_normalized
4892            University of Trieste            University of Trieste
4893           University of Zaragoza           University of Zaragoza
4894            Utah State University                             None
4895  Vienna University of Technology  Vienna University of Technology
4896           Wake Forest University           Wake Forest University

Rimuovo le rows contenenti None in 'university_name_normalized' e creo delle nuove tabelle.

In [90]:
shanghaiDb_norm = shanghaiDb.drop(shanghaiDb[shanghaiDb['university_name_normalized'].isnull()].index)

In [91]:
timesDb_norm = timesDb.drop(timesDb[timesDb['university_name_normalized'].isnull()].index)

In [92]:
cwurDb_norm = cwurDb.drop(cwurDb[cwurDb['university_name_normalized'].isnull()].index)

Tramite la funzione set() mi creo un dizionario contenente le universitÃ  per tutti i database. 

Tale funzione Ã¨ definita come set(iterable), dove con iterable si richiede una un qualsiasi oggetto iterabile. Si passa quindi la serie ottenuta dai db.

In [93]:
shanghaiDb_norm_university = set(shanghaiDb_norm['university_name_normalized'])

In [94]:
timesDb_norm_university = set(timesDb_norm['university_name_normalized'])

In [95]:
cwurDb_norm_university = set(cwurDb_norm['university_name_normalized'])

Mi creo un dizionario chiamato 'appearence_of_university' su cui successivamente aggiungero e conterÃ² il numero di volte che Ã¨ contenuta l'universitÃ  nei dizionari ottenuti alle righe precedenti.

In [96]:
appearence_of_university = {}

In [97]:
for university in shanghaiDb_norm_university:
    appearence_of_university[university] = 1
for university in timesDb_norm_university:
    if university not in appearence_of_university:
        appearence_of_university[university] = 1
    else:
        appearence_of_university[university] += 1
for university in cwurDb_norm_university:
    if university not in appearence_of_university:
        appearence_of_university[university] = 1
    else:
        appearence_of_university[university] += 1

In [98]:
appearence_of_university

{'Osaka Prefecture University': 3,
 'University of Toronto': 3,
 'Laval University': 3,
 'University of Aberdeen': 3,
 'Pennsylvania State University': 3,
 'University of Wyoming': 3,
 'Flinders University': 3,
 'University of Strasbourg': 3,
 'University of South Carolina': 3,
 'University of Oxford': 3,
 'Boston University': 3,
 'National Central University': 3,
 'University of Cambridge': 3,
 'SÃ£o Paulo State University (UNESP)': 2,
 'Syracuse University': 3,
 'Bar-Ilan University': 3,
 'University of Zurich': 3,
 'ETH Zurich â Swiss Federal Institute of Technology Zurich': 2,
 'Memorial University of Newfoundland': 3,
 'University of Vienna': 3,
 'University of Leicester': 3,
 'University of Minnesota': 3,
 'University of British Columbia': 3,
 'University of Maryland, Baltimore County': 3,
 'Kanazawa University': 3,
 'National Autonomous University of Mexico': 3,
 'Tianjin University': 3,
 'Karlsruhe Institute of Technology': 3,
 'University College London': 3,
 'University of Hong Kong': 3,
 'University of California, San Diego': 3,
 'Utrecht University': 3,
 'University of Science and Technology of China': 3,
 'Johns Hopkins University': 3,
 'Technical University of Dortmund': 3,
 'University of Texas at San Antonio': 3,
 'Maastricht University': 3,
 'Sichuan University': 3,
 'Polytechnic University of Turin': 3,
 'Pohang University of Science and Technology': 3,
 'Tulane University': 3,
 'Jagiellonian University': 3,
 'National Sun Yat-Sen University': 2,
 'University of Turin': 3,
 'Autonomous University of Barcelona': 3,
 'Brandeis University': 3,
 'University of Alberta': 3,
 'University of Delaware': 3,
 'National Cheng Kung University': 3,
 'Hanyang University': 3,
 'Tokyo Institute of Technology': 3,
 'Oregon State University': 3,
 'Paris Dauphine University': 2,
 'South China University of Technology': 3,
 'Technical University of Berlin': 3,
 'University of California, Irvine': 3,
 'Swansea University': 3,
 'KU Leuven': 2,
 'Norwegian University of Science and Technology': 3,
 'University of Iowa': 3,
 'Case Western Reserve University': 3,
 'Nagasaki University': 3,
 'University of Southern California': 3,
 'University of Zaragoza': 3,
 'Istanbul University': 3,
 'University of Bradford': 3,
 'Texas Tech University': 3,
 'Korea University': 3,
 'Rensselaer Polytechnic Institute': 3,
 'King Saud University': 3,
 'Gifu University': 3,
 'Northeastern University': 3,
 'Capital Medical University': 3,
 'University of Otago': 3,
 'Complutense University of Madrid': 3,
 'Cairo University': 3,
 'University of Notre Dame': 3,
 'Erasmus University Rotterdam': 3,
 'University of Western Australia': 3,
 'Waseda University': 3,
 'University of Missouri': 3,
 'Nanjing University': 3,
 'Nagoya University': 3,
 'University of Bergen': 3,
 'Swinburne University of Technology': 3,
 'Yonsei University': 3,
 'Indian Institute of Technology Kharagpur': 3,
 'Chalmers University of Technology': 3,
 'University of Wollongong': 3,
 'Ehime University': 3,
 'University of Hertfordshire': 3,
 'University of Arkansas': 3,
 'University of Padua': 3,
 'Wake Forest University': 3,
 'University of Calcutta': 3,
 'Georgetown University': 3,
 'University of Manitoba': 3,
 'Lehigh University': 3,
 'TU Dresden': 2,
 'Brown University': 3,
 'University of Montreal': 3,
 'University of KwaZulu-Natal': 3,
 'The Open University': 2,
 'University of Cincinnati': 3,
 'University of Calgary': 3,
 'Tokyo University of Agriculture and Technology': 3,
 'University of Porto': 3,
 'Okayama University': 3,
 'University of Genoa': 3,
 'Saint Louis University': 3,
 'Uppsala University': 3,
 'Massey University': 3,
 'University of Szeged': 3,
 'University of Helsinki': 3,
 'University of Surrey': 3,
 'University of Bologna': 3,
 'Chiba University': 3,
 'Sungkyunkwan University (SKKU)': 3,
 'Deakin University': 3,
 'University of Oslo': 3,
 'University of East Anglia': 3,
 'University of California, Santa Cruz': 3,
 'University of Houston': 3,
 'National Taiwan University': 3,
 'Jilin University': 3,
 'Brunel University London': 3,
 'Bielefeld University': 3,
 'Vrije Universiteit Brussel': 3,
 'Colorado State University': 3,
 'Carnegie Mellon University': 3,
 'University of Barcelona': 3,
 'Simon Fraser University': 3,
 'University of Chile': 3,
 'University of Nottingham': 3,
 'University of Auckland': 3,
 'University of Tehran': 3,
 'University of Georgia': 3,
 'Polytechnic University of Catalonia': 3,
 'University of Sussex': 3,
 'University of Oklahoma': 3,
 'Autonomous University of Madrid': 3,
 'University of Amsterdam': 3,
 'Federal University of Rio de Janeiro': 3,
 'Kyoto University': 3,
 'Duke University': 3,
 'Charles University in Prague': 3,
 'Tufts University': 3,
 'University of Siena': 3,
 'Florida International University': 3,
 'University of Ferrara': 3,
 'Joseph Fourier University': 3,
 'University of Wisconsin': 3,
 'Virginia Polytechnic Institute and State University': 3,
 'University of Miami': 3,
 'University of Warsaw': 3,
 'University of Washington': 3,
 'University of Maryland, College Park': 3,
 'Medical College of Wisconsin': 3,
 'University of Geneva': 3,
 'Wayne State University': 3,
 'Dalhousie University': 3,
 'Soochow University': 3,
 'University of Birmingham': 3,
 'Southern Methodist University': 3,
 'University of Belgrade': 3,
 'University College Dublin': 3,
 'Aalto University': 3,
 'University of Warwick': 3,
 'Aarhus University': 3,
 'University of the Witwatersrand': 3,
 'University of Nice Sophia Antipolis': 3,
 'Technical University of Denmark': 3,
 'Hacettepe University': 3,
 'Harvard University': 3,
 'Indian Institute of Science': 3,
 'University College Cork': 3,
 'University of Bari Aldo Moro': 3,
 'Technical University of Munich': 3,
 'Federal University of Rio Grande do Sul': 3,
 'University of New Mexico': 3,
 'The University of Queensland': 3,
 'Monash University': 3,
 'University of Virginia': 3,
 'Oregon Health and Science University': 2,
 'University of Vigo': 3,
 'VU University Amsterdam': 3,
 'National Tsing Hua University': 3,
 'Stellenbosch University': 3,
 'National University of Singapore': 3,
 'Queen Mary University of London': 3,
 'University of Freiburg': 3,
 'University of Bremen': 3,
 'University of Utah': 3,
 'Keio University': 3,
 'University of Pennsylvania': 3,
 'Loughborough University': 3,
 'University of Duisburg-Essen': 3,
 'Stony Brook University': 3,
 'University of Rennes 1': 3,
 'University of Bath': 3,
 'University of Valencia': 3,
 'University of Chicago': 3,
 'University of Reading': 3,
 'University of Montana': 3,
 'Indiana University': 3,
 'Howard University': 3,
 'Tel Aviv University': 3,
 'Tsinghua University': 3,
 'University of Trieste': 3,
 'Massachusetts Institute of Technology': 3,
 'University of Essex': 3,
 'Clemson University': 3,
 'State University of Campinas': 3,
 'Stanford University': 3,
 'University of Saskatchewan': 3,
 'Northwestern University': 3,
 'Seoul National University': 3,
 'University of Basel': 3,
 'University of Cape Town': 3,
 'Michigan Technological University': 3,
 'Pontifical Catholic University of Chile': 3,
 'Temple University': 3,
 'Shanghai Jiao Tong University': 3,
 'University of Massachusetts': 3,
 'RWTH Aachen University': 3,
 'Federal University of Minas Gerais': 3,
 'Birkbeck, University of London': 3,
 'Iowa State University': 3,
 'University of Nebraska Medical Center': 3,
 'New Jersey Institute of Technology': 3,
 'University of Erlangen-Nuremberg': 3,
 'University of Kiel': 3,
 'Macquarie University': 3,
 'Michigan State University': 3,
 'Karolinska Institute': 3,
 'University of Fribourg': 3,
 'Victoria University of Wellington': 3,
 'Tilburg University': 3,
 'Ohio University': 3,
 'University of Milan': 3,
 'Ben-Gurion University of the Negev': 3,
 'University of Canterbury': 3,
 'University of Bern': 3,
 'Ohio State University': 3,
 'University of Victoria': 3,
 'University of Sydney': 3,
 'Juntendo University': 3,
 'Harbin Institute of Technology': 3,
 'University of Sheffield': 3,
 'University of Twente': 3,
 'Chungnam National University': 3,
 'Hong Kong Polytechnic University': 3,
 'China Agricultural University': 3,
 'University of Illinois at Urbana-Champaign': 2,
 'University of Southern Denmark': 3,
 'Osaka University': 3,
 'Queensland University of Technology': 3,
 'University of California, Davis': 3,
 'Sun Yat-sen University': 3,
 'Kyung Hee University': 3,
 'Kumamoto University': 3,
 'Arizona State University': 3,
 'Medical University of South Carolina': 3,
 'University at Buffalo': 3,
 'McMaster University': 3,
 'Vanderbilt University': 3,
 'University of Naples Federico II': 3,
 'Polytechnic University of Valencia': 3,
 'University of the Basque Country': 3,
 'University of York': 3,
 'Drexel University': 3,
 'Auburn University': 3,
 'University of Granada': 3,
 'Vienna University of Technology': 3,
 'University of Konstanz': 3,
 'University of Western Ontario': 3,
 'University of Turku': 3,
 'University of Tsukuba': 3,
 'University of Groningen': 3,
 'Kyungpook National University': 3,
 'University of Melbourne': 3,
 'Claude Bernard University Lyon 1': 3,
 'Georgia Institute of Technology': 3,
 'University of Vermont': 3,
 'Rice University': 3,
 'University of Antwerp': 3,
 'Tongji University': 3,
 'Wuhan University': 3,
 'Hokkaido University': 3,
 'University of Ljubljana': 3,
 'Cardiff University': 3,
 'University of North Carolina at Chapel Hill': 3,
 'University of Tasmania': 3,
 'University of Manchester': 3,
 'Huazhong University of Science and Technology': 3,
 'University of Bordeaux': 3,
 'Fudan University': 3,
 'Lomonosov Moscow State University': 3,
 'Korea Advanced Institute of Science and Technology (KAIST)': 3,
 'Washington State University': 3,
 'Lund University': 3,
 'North Carolina State University': 3,
 'Peking University': 3,
 'Griffith University': 3,
 'University of Palermo': 3,
 'Princeton University': 3,
 'Oklahoma State University': 3,
 'Newcastle University': 3,
 'Cornell University': 3,
 'National and Kapodistrian University of Athens': 3,
 'Aix-Marseille University': 3,
 'Ewha Womans University': 3,
 'University of Texas at Dallas': 3,
 'Kent State University': 3,
 'University of Copenhagen': 3,
 'University of Texas at Austin': 3,
 'Kansas State University': 3,
 'Eindhoven University of Technology': 3,
 'Yeshiva University': 3,
 'China Medical University, Taiwan': 2,
 'University of Bristol': 3,
 'University of California, Los Angeles': 3,
 'University of Oregon': 3,
 'Lancaster University': 3,
 'George Washington University': 3,
 'Texas A&M University': 3,
 'Purdue University': 3,
 'San Diego State University': 3,
 'University of Michigan': 3,
 'Kyushu University': 3,
 'Tohoku University': 3,
 'University of Lausanne': 3,
 'Louisiana State University': 3,
 'Montana State University': 3,
 'Curtin University': 3,
 'University of Pretoria': 3,
 'Australian National University': 3,
 'King Abdulaziz University': 3,
 'Sapienza University of Rome': 3,
 'University of California, Santa Barbara': 3,
 'Hong Kong University of Science and Technology': 3,
 'Pusan National University': 3,
 'University of Bonn': 3,
 'Chang Gung University': 3,
 'University of St Andrews': 3,
 'Emory University': 3,
 'Trinity College Dublin': 2,
 'Old Dominion University': 3,
 'James Cook University': 3,
 'University of Rochester': 3,
 'Dartmouth College': 3,
 'Kobe University': 3,
 'University of Liverpool': 3,
 'Aristotle University of Thessaloniki': 3,
 'University of Exeter': 3,
 'Yale University': 3,
 'London School of Economics and Political Science': 3,
 'University of Seville': 3,
 'Leiden University': 3,
 'Aalborg University': 3,
 'Murdoch University': 3,
 'Hebrew University of Jerusalem': 3,
 'University of Kentucky': 3,
 'New York University': 3,
 'University of Haifa': 3,
 'Ghent University': 3,
 'University of Arizona': 3,
 'New Mexico State University': 3,
 'University of Leeds': 3,
 'City University of Hong Kong': 3,
 'Medical University of Vienna': 3,
 'Radboud University Nijmegen': 3,
 'University of Graz': 3,
 'KTH Royal Institute of Technology': 3,
 'Osaka City University': 3,
 'University of South Florida': 3,
 'University of Gothenburg': 3,
 'University of California, Berkeley': 3,
 'Johannes Gutenberg University of Mainz': 3,
 'University of Pittsburgh': 3,
 'Tokyo University of Science': 3,
 'University of Pisa': 3,
 'Sharif University of Technology': 3,
 'University of Strathclyde': 3,
 'Nanyang Technological University': 3,
 'Boston College': 3,
 'California Institute of Technology': 3,
 'Tokyo Metropolitan University': 3,
 'Catholic University of the Sacred Heart': 3,
 'Durham University': 3,
 'Rush University': 3,
 'University of Florence': 3,
 'Heidelberg University': 2,
 'University of Eastern Finland': 3,
 'University of Tokyo': 3,
 'George Mason University': 3,
 'University of Guelph': 3,
 'Carleton University': 3,
 'University of Lisbon': 3,
 'Portland State University': 3,
 'Delft University of Technology': 3,
 'Niigata University': 3,
 'University of Parma': 3,
 'University of Waterloo': 3,
 'Florida State University': 3,
 'University of Dundee': 3,
 'University of California, Riverside': 3,
 'University of Idaho': 3,
 'McGill University': 3,
 'University of Connecticut': 3,
 'National Chiao Tung University': 3,
 'University of Ottawa': 3,
 'University of Greifswald': 3,
 'University of Coimbra': 3,
 'University of Adelaide': 3,
 'Dalian University of Technology': 3,
 'University of Pavia': 3,
 'University of Oulu': 3,
 'York University': 3,
 'Swedish University of Agricultural Sciences': 3,
 'University of Hamburg': 3,
 'Columbia University': 3,
 'University of New South Wales': 3,
 'Hiroshima University': 3,
 'Zhejiang University': 3,
 'University of Illinois at Chicago': 3,
 'East China University of Science and Technology': 3,
 'University of Glasgow': 3,
 'La Trobe University': 3,
 'University of Innsbruck': 3,
 'Concordia University': 3,
 'Pompeu Fabra University': 3,
 'University of Edinburgh': 3,
 'University of Stuttgart': 3,
 'Bangor University': 3,
 'University of Kansas': 3,
 'University of Florida': 3,
 'Stockholm University': 3,
 'University of Cagliari': 3,
 'University of Southampton': 3,
 'Saint Petersburg State University': 3,
 'Tokyo Medical and Dental University (TMDU)': 3,
 'University of Newcastle': 3,
 'Xiamen University': 3,
 'Shanghai University': 2,
 'Rutgers, the State University of New Jersey': 1,
 'University of Trento': 2,
 'University of Colorado Boulder': 2,
 'University of Wisconsin-Madison': 1,
 'University of Burgundy': 2,
 'Tomsk Polytechnic University': 1,
 'LinkÃ¶ping University': 2,
 'Taipei Medical University': 2,
 'California State University, Long Beach': 1,
 'Tokushima University': 1,
 'BoÄaziÃ§i University': 2,
 'University of A CoruÃ±a': 2,
 'University of Hull': 2,
 'University of Westminster': 1,
 'University of Navarra': 2,
 'University of Indonesia': 1,
 'University of Central Lancashire': 2,
 'Tampere University of Technology': 2,
 'Amirkabir University of Technology': 2,
 'University of Catania': 2,
 'Instituto Superior TÃ©cnico Lisboa': 1,
 'Kingâs College London': 1,
 'RMIT University': 2,
 'University of Delhi': 2,
 'Xiâan Jiaotong University': 1,
 'Yeungnam University': 2,
 'Anadolu University': 1,
 'EÃ¶tvÃ¶s LorÃ¡nd University': 2,
 'Toyohashi University of Technology': 1,
 'Free University of Berlin': 2,
 'Sheffield Hallam University': 1,
 'Birla Institute of Technology and Science, Pilani': 1,
 'Copenhagen Business School': 1,
 'Oakland University': 2,
 'Aston University': 2,
 'Royal College of Surgeons in Ireland': 2,
 'Universiti Kebangsaan Malaysia': 1,
 'Bilkent University': 2,
 'American University': 1,
 'Monterrey Institute of Technology and Higher Education': 1,
 'Chinese University of Hong Kong': 2,
 'AGH University of Science and Technology': 2,
 'University of Ghana': 1,
 'University of Waikato': 2,
 'Wuhan University of Technology': 2,
 'Jordan University of Science and Technology': 1,
 'Kyushu Institute of Technology': 1,
 'University of Murcia': 2,
 'National Taiwan Ocean University': 2,
 'Savitribai Phule Pune University': 1,
 'Xidian University': 2,
 'Paris Diderot University â Paris 7': 1,
 'University of Santiago, Chile (USACH)': 1,
 'UniversitÃ© Catholique de Louvain': 1,
 'University of Portsmouth': 2,
 'Warsaw University of Technology': 2,
 'University of Hawaiâi at MÄnoa': 1,
 'University of Texas at Arlington': 2,
 'Binghamton University, State University of New York': 2,
 'Alexandria University': 2,
 'University of St Gallen': 1,
 'Pontifical Catholic University of Rio Grande do Sul (PUCRS)': 1,
 'Pontifical Catholic University of Rio de Janeiro (PUC-Rio)': 1,
 'University of South Africa': 1,
 'University of GÃ¶ttingen': 2,
 'Aberystwyth University': 2,
 'Masaryk University': 2,
 'LMU Munich': 1,
 'Tehran University of Medical Sciences': 2,
 'PalackÃ½ University in Olomouc': 1,
 'University of San Francisco': 1,
 'Southern Federal University': 1,
 'Illinois Institute of Technology': 2,
 'Bayreuth University': 1,
 'PanthÃ©on-Sorbonne University â Paris 1': 1,
 'Ãcole Normale SupÃ©rieure': 1,
 'National University of Ireland, Maynooth': 2,
 'Chulalongkorn University': 2,
 'Universiti Teknologi Malaysia': 1,
 'Hong Kong Baptist University': 2,
 'University of Pardubice': 1,
 'Sogang University': 2,
 'University of Cergy-Pontoise': 1,
 'Mines ParisTech': 2,
 'Khon Kaen University': 1,
 'Keele University': 2,
 'University of Tartu': 2,
 'Gwangju Institute of Science and Technology': 2,
 'Sejong University': 2,
 'University of Antioquia': 1,
 'Ãcole Polytechnique FÃ©dÃ©rale de Lausanne': 1,
 'Tottori University': 2,
 'National Taiwan Normal University': 2,
 'University of Lincoln': 1,
 'Rio de Janeiro State University (UERJ)': 2,
 'Peter the Great St Petersburg Polytechnic University': 1,
 'Kingston University': 1,
 'Royal Veterinary College': 2,
 'Isfahan University of Technology': 2,
 'Carlos III University of Madrid': 2,
 'University of Ibadan': 1,
 'Graz University of Technology': 2,
 'Suez Canal University': 1,
 'Beijing Institute of Technology': 2,
 'Ãcole Normale SupÃ©rieure de Lyon': 1,
 'University of South Dakota': 1,
 'Bauman Moscow State Technical University': 1,
 'Yokohama City University': 2,
 'Athens University of Economics and Business': 1,
 'Federal University of Bahia': 2,
 'China University of Petroleum (Beijing)': 1,
 'Royal Holloway, University of London': 2,
 'Technion Israel Institute of Technology': 1,
 'Pontifical Catholic University of ValparaÃ­so': 1,
 'Nottingham Trent University': 2,
 'Imperial College London': 2,
 'Qatar University': 1,
 'Sophia University': 1,
 'Otto von Guericke University of Magdeburg': 1,
 'University of Alaska Fairbanks': 2,
 'Asia University, Taiwan': 1,
 'University of Castilla-La Mancha': 1,
 'American University of Beirut': 2,
 'Budapest University of Technology and Economics': 2,
 'University of Texas at El Paso': 2,
 'Hunan University': 2,
 'Tokai University': 2,
 'University of Limerick': 2,
 'University of Iceland': 2,
 'Chung-Ang University': 2,
 'University of Huddersfield': 1,
 'University of Aveiro': 2,
 'University of AlcalÃ¡': 2,
 'City University London': 2,
 'University of Southern Mississippi': 2,
 'Indian Institute of Technology Roorkee': 2,
 'University of Kaiserslautern': 1,
 'Georgia State University': 2,
 'Federal University of Lavras': 1,
 'Glasgow Caledonian University': 1,
 'West University of TimiÅoara': 1,
 'Moscow Institute of Physics and Technology': 2,
 'Chung Yuan Christian University': 2,
 'Federico Santa MarÃ­a Technical University': 2,
 'Bournemouth University': 1,
 'University of Debrecen': 2,
 'Miami University': 2,
 'Slovak University of Technology in Bratislava': 1,
 'Technical University of Darmstadt': 1,
 'Blaise Pascal University': 2,
 'Colorado School of Mines': 2,
 'King Mongkutâs University of Technology Thonburi': 1,
 'Toulouse 1 Capitole University': 1,
 'Ajou University': 2,

# 11. In the times ranking, compute the number of times each university appears.

In [99]:
timesDb_count = timesDb_norm.groupby('university_name').size()
timesDb_count

university_name
AGH University of Science and Technology    1
Aalborg University                          5
Aalto University                            5
Aarhus University                           6
Aberystwyth University                      5
                                           ..
Ãcole Normale SupÃ©rieure                    6
Ãcole Normale SupÃ©rieure de Lyon            6
Ãcole Polytechnique                         6
Ãcole Polytechnique FÃ©dÃ©rale de Lausanne    6
Ãrebro University                           1
Length: 818, dtype: int64

# 12. Find the universities that appear at most twice in the times ranking.

In [100]:
timesDb_count.loc[timesDb_count <= 2]

university_name
AGH University of Science and Technology    1
Adam Mickiewicz University                  1
Aix-Marseille University                    1
Ajou University                             1
Alexandru Ioan Cuza University              1
                                           ..
Yokohama City University                    1
Yokohama National University                1
Yuan Ze University                          2
YÄ±ldÄ±z Technical University                 1
Ãrebro University                           1
Length: 408, dtype: int64

# 13. The universities that, in any year, have the same position in all three rankings (they must have the same position in a year).

In modo analogo al punto 4, con la differenza che si lavorava su tutti i data presenti nei db, eseguo gli stessi passaggi.

### Pulizia timesDb

In [101]:
timesDb['world_rank_min'] = timesDb['world_rank'].str.extract('=*(\d+)-*').astype(float)
timesDb['world_rank_max'] = timesDb['world_rank'].str.extract('-(\d+)').astype(float)

In [102]:
timesDb['world_rank_max'] = np.where((timesDb['world_rank_max'] >= 0), 
                                      timesDb['world_rank_max'], 
                                      timesDb['world_rank_min'])
timesDb.head(3)

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,university_name_normalized,world_rank_min,world_rank_max
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011,Harvard University,1.0,1.0
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011,California Institute of Technology,2.0,2.0
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011,Massachusetts Institute of Technology,3.0,3.0

In [103]:
timesDb_world_rank = timesDb[['university_name_normalized', 'year', 'world_rank', 'world_rank_min', 'world_rank_max']]
timesDb_world_rank

,university_name_normalized,year,world_rank,world_rank_min,world_rank_max
0,Harvard University,2011,1,1.0,1.0
1,California Institute of Technology,2011,2,2.0,2.0
2,Massachusetts Institute of Technology,2011,3,3.0,3.0
3,Stanford University,2011,4,4.0,4.0
4,Princeton University,2011,5,5.0,5.0
...,...,...,...,...,...
2598,Yeungnam University,2016,601-800,601.0,800.0
2599,YÄ±ldÄ±z Technical University,2016,601-800,601.0,800.0
2600,Yokohama City University,2016,601-800,601.0,800.0
2601,Yokohama National University,2016,601-800,601.0,800.0
2602,Yuan Ze University,2016,601-800,601.0,800.0

### Pulizia shanghaiDb

In [104]:
shanghaiDb['world_rank_min'] = shanghaiDb['world_rank'].str.extract('=*(\d+)-*').astype(float)
shanghaiDb['world_rank_max'] = shanghaiDb['world_rank'].str.extract('-(\d+)').astype(float)

In [105]:
shanghaiDb['world_rank_max'] = np.where((shanghaiDb['world_rank_max'] >= 0), 
                                         shanghaiDb['world_rank_max'], 
                                         shanghaiDb['world_rank_min'])
shanghaiDb.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,university_name_normalized,world_rank_min,world_rank_max
0,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005,Harvard University,1.0,1.0
1,2,University of Cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005,University of Cambridge,2.0,2.0
2,3,Stanford University,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005,Stanford University,3.0,3.0
3,4,"University of California, Berkeley",3,72.8,71.8,76.0,69.4,73.9,72.2,52.7,2005,"University of California, Berkeley",4.0,4.0
4,5,Massachusetts Institute of Technology (MIT),4,70.1,74.0,80.6,66.7,65.8,64.3,53.0,2005,Massachusetts Institute of Technology,5.0,5.0

In [106]:
shanghaiDb_world_rank = shanghaiDb[['university_name_normalized', 'year', 'world_rank', 'world_rank_min', 'world_rank_max']]
shanghaiDb_world_rank

,university_name_normalized,year,world_rank,world_rank_min,world_rank_max
0,Harvard University,2005,1,1.0,1.0
1,University of Cambridge,2005,2,2.0,2.0
2,Stanford University,2005,3,3.0,3.0
3,"University of California, Berkeley",2005,4,4.0,4.0
4,Massachusetts Institute of Technology,2005,5,5.0,5.0
...,...,...,...,...,...
4892,University of Trieste,2015,401-500,401.0,500.0
4893,University of Zaragoza,2015,401-500,401.0,500.0
4894,None,2015,401-500,401.0,500.0
4895,Vienna University of Technology,2015,401-500,401.0,500.0
4896,Wake Forest University,2015,401-500,401.0,500.0

### Pulizia cwurDb

In [107]:
cwurDb['world_rank'] = cwurDb['world_rank'].astype(float)

In [108]:
cwurDb_world_rank =  cwurDb[['university_name_normalized', 'year', 'world_rank']]

Per eseguire le join fra le tabelle utilizzo la colonna 'univeristy_name_normalized' inserita al point 10 tramite la funzione 'normalize_function'. Il risultato di questa normalizzazione aveva provocato dei valori None che si era deciso di rimuovere.

In [109]:
db_rank_position = pd.merge(timesDb_world_rank, shanghaiDb_world_rank, on = ('university_name_normalized', 'year'), 
                            suffixes = ('_times', '_shanghai'))
db_rank_position.head()

,university_name_normalized,year,world_rank_times,world_rank_min_times,world_rank_max_times,world_rank_shanghai,world_rank_min_shanghai,world_rank_max_shanghai
0,Harvard University,2011,1,1.0,1.0,1,1.0,1.0
1,California Institute of Technology,2011,2,2.0,2.0,6,6.0,6.0
2,Massachusetts Institute of Technology,2011,3,3.0,3.0,3,3.0,3.0
3,Stanford University,2011,4,4.0,4.0,2,2.0,2.0
4,Princeton University,2011,5,5.0,5.0,7,7.0,7.0

In [110]:
db_rank_position1 = pd.merge(db_rank_position, cwurDb_world_rank, on = ('university_name_normalized', 'year'), 
                             suffixes = ('', '_cwurd'))
db_rank_position1.head()

,university_name_normalized,year,world_rank_times,world_rank_min_times,world_rank_max_times,world_rank_shanghai,world_rank_min_shanghai,world_rank_max_shanghai,world_rank
0,California Institute of Technology,2012,1,1.0,1.0,6,6.0,6.0,5.0
1,Harvard University,2012,2,2.0,2.0,1,1.0,1.0,1.0
2,Stanford University,2012,2,2.0,2.0,2,2.0,2.0,3.0
3,University of Oxford,2012,4,4.0,4.0,10,10.0,10.0,7.0
4,Princeton University,2012,5,5.0,5.0,7,7.0,7.0,6.0

In [111]:
db_rank_position1.rename(columns={'world_rank': 'world_rank_cwurd'}, inplace=True)
db_rank_position1.head(3)

,university_name_normalized,year,world_rank_times,world_rank_min_times,world_rank_max_times,world_rank_shanghai,world_rank_min_shanghai,world_rank_max_shanghai,world_rank_cwurd
0,California Institute of Technology,2012,1,1.0,1.0,6,6.0,6.0,5.0
1,Harvard University,2012,2,2.0,2.0,1,1.0,1.0,1.0
2,Stanford University,2012,2,2.0,2.0,2,2.0,2.0,3.0

In [112]:
result = db_rank_position1.loc[(((db_rank_position1['world_rank_cwurd'] >= db_rank_position1['world_rank_min_times']) 
                                    & (db_rank_position1['world_rank_cwurd'] <= db_rank_position1['world_rank_max_times'])) 
                                   & (((db_rank_position1['world_rank_cwurd'] >= db_rank_position1['world_rank_min_shanghai']) 
                                & (db_rank_position1['world_rank_cwurd'] <= db_rank_position1['world_rank_max_shanghai']))))]

In [113]:
result[['university_name_normalized','year', 'world_rank_times', 'world_rank_shanghai', 'world_rank_cwurd']]

,university_name_normalized,year,world_rank_times,world_rank_shanghai,world_rank_cwurd
78,Stanford University,2013,2,2,2.0
273,University of Southampton,2014,146,101-150,146.0
324,Sungkyunkwan University (SKKU),2014,201-225,201-300,204.0
413,University of Vermont,2014,301-350,301-400,320.0
429,Temple University,2014,351-400,301-400,390.0
630,Newcastle University,2015,201-225,201-300,212.0
644,Autonomous University of Barcelona,2015,226-250,201-300,241.0
648,Laval University,2015,226-250,201-300,229.0
660,Medical University of Vienna,2015,251-275,201-300,265.0
675,University of Waterloo,2015,251-275,201-300,269.0
694,University of South Carolina,2015,276-300,201-300,300.0
753,University of Turku,2015,351-400,301-400,383.0
756,Washington State University,2015,351-400,301-400,380.0